<?php

// +----------------------------------------------------------------------
// |  HlwAdmin
// +----------------------------------------------------------------------
// | 版权所有 2014~2024 hlw2326
// +----------------------------------------------------------------------
// | 邮箱: 1608626143@qq.com
// | 官方网站: https://www.hlw2326.com
// +----------------------------------------------------------------------

return [
    // 默认日志通道
    'default'      => 'file',
    // 日志记录级别
    'level'        => [],
    // 日志类型记录的通道
    'type_channel' => [],
    // 关闭全局日志写入
    'close'        => false,
    // 全局日志处理 支持闭包
    'processor'    => null,
    // 日志通道列表
    'channels'     => [
        'file' => [
            // 日志记录方式
            'type'           => 'File',
            // 日志保存目录
            'path'           => '',
            // 单文件日志写入
            'single'         => true,
            // 独立日志级别
            'apart_level'    => true,
            // 每个文件大小 ( 10兆 )
            'file_size'      => 10485760,
            // 日志日期格式
            'time_format'    => 'Y-m-d H:i:s',
            // 最大日志文件数量
            'max_files'      => 100,
            // 使用JSON格式记录
            'json'           => false,
            // 日志处理
            'processor'      => null,
            // 关闭通道日志写入
            'close'          => false,
            // 日志输出格式化
            'format'         => '[%s][%s] %s',
            // 是否实时写入
            'realtime_write' => false,
        ],
    ],
];
